jfazli/PE208/F429HMIPlatform-bsp/Project/MicroEJ/MDK-ARM/stm324x9i_eval_lcd-v2.c
/**
  ******************************************************************************
  * @file    STM324x9i_eval_lcd.c
  * @author  MCD Application Team
  * @version V0.1.0
  * @date    07-December-2012
  * @brief   This file includes the LCD driver for AM480272H3TMQW-T01H 
  *          and AM640480G5TNQW-T00H Liquid Crystal Display Modules
  *          of STM324x9I-EVAL evaluation board(MB1045).
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  ******************************************************************************  
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm324x9i_eval_lcd.h"
#include "stm32f4xx_dma2d.h"
#include "../Common/fonts.c"

/** @addtogroup Utilities
  * @{
  */ 

/** @addtogroup STM32_EVAL
  * @{
  */ 

/** @addtogroup STM324x9I_EVAL
  * @{
  */
    
/** @defgroup STM324x9I_EVAL_LCD 
  * @brief This file includes the LCD driver for AM480272H3TMQW-T01H 
  *        and AM640480G5TNQW-T00H Liquid Crystal Display Modules
  *        of STM324x9I_EVAL board.
  * @{
  */ 

/** @defgroup STM324x9I_EVAL_LCD_Private_TypesDefinitions
  * @{
  */ 

/**
  * @}
  */ 

/** @defgroup STM324x9I_EVAL_LCD_Private_Defines
  * @{
  */
	

#define POLY_X(Z)              ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)              ((int32_t)((Points + Z)->Y))
#define LCD_FRAME_BUFFER       ((uint32_t)0xC0000000)
//#define LCD_FRAME_BUFFER       ((uint32_t)0x64000000)

#define BUFFER_OFFSET          LCD_PIXEL_HEIGHT * LCD_PIXEL_HEIGHT * 4 //((uint32_t)0x130000)
  
#define LCD_TIMEOUT_MAX    0x3000 /*<! The value of the maximal timeout for I2C waiting loops */    

/**
  * @}
  */ 

/** @defgroup STM324x9I_EVAL_LCD_Private_Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))     
/**
  * @}
  */ 
 	
	
	LCD_480272_TypeDef *LCD_FrameBuf;
	
 

/** @defgroup STM324x9I_EVAL_LCD_Private_Variables
  * @{
  */ 
static sFONT *LCD_Currentfonts;

/* Global variables to set the written text color */
static uint16_t CurrentTextColor   = 0x0000;
static uint16_t CurrentBackColor   = 0xFFFF;
/* Default LCD configuration with LCD Layer 1 */
static uint32_t CurrentFrameBuffer = LCD_FRAME_BUFFER;
static uint32_t CurrentLayer = LCD_BACKGROUND_LAYER;
  
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_LCD_Private_FunctionPrototypes
  * @{
  */ 
static void PutPixel(int16_t x, int16_t y);
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);
static void LCD_AF_GPIOConfig(void);


/**
  * @}
  */ 

/*******************************************************************************
* Function Name  : LCD_WriteRAM
* Description    : Writes to the LCD RAM.
* Input          : - RGB_Code: the pixel color in RGB mode (5-6-5).
* Output         : None
* Return         : None
*******************************************************************************/

/** @defgroup STM324x9I_EVAL_LCD_Private_Functions
  * @{
  */ 
	
void LCD_WriteSDRAM(u16* LCD_Ptr,uint16_t RGB_Code)
{
  *LCD_Ptr = RGB_Code;
}

/**
  * @brief  DeInitializes the LCD.
  * @param  None
  * @retval None
  */
void LCD_DeInit(void)
{ 
 GPIO_InitTypeDef GPIO_InitStructure;

  /* LCD Display Off */
  LCD_DisplayOff();
   
  /* GPIO Configuration ------------------------------------------------------*/
  /* GPIOD configuration */
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource4, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource5, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_4  |
                                GPIO_Pin_5  |  GPIO_Pin_8 | GPIO_Pin_9  | 
                                GPIO_Pin_14 | GPIO_Pin_15;
  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

  GPIO_Init(GPIOD, &GPIO_InitStructure);

  /* GPIOE configuration */
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource11 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource15 , GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_7  |
                                GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_10 | 
                                GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | 
                                GPIO_Pin_14 | GPIO_Pin_15;

  GPIO_Init(GPIOE, &GPIO_InitStructure);

  /* GPIOF configuration */
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource11 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource15 , GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_2  | 
                                GPIO_Pin_3  | GPIO_Pin_4  | GPIO_Pin_5  | 
                                GPIO_Pin_11 | GPIO_Pin_10 | GPIO_Pin_12 | 
                                GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;      

  GPIO_Init(GPIOF, &GPIO_InitStructure);

  /* GPIOG configuration */
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource15 , GPIO_AF_MCO);
  

