jfazli/PE208/F429HMIPlatform-bsp/Project/MicroEJ/MDK-ARM/stm324x9i_eval_lcd-v2.c
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | 
                                GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 | 
                                GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | 
                                GPIO_Pin_15;        

  GPIO_Init(GPIOG, &GPIO_InitStructure);
  
  
  /* GPIOH configuration */
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource11 , GPIO_AF_MCO);

  

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_5 | 
                                GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_11;      

  GPIO_Init(GPIOH, &GPIO_InitStructure);

  /* GPIOI configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource15 , GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1  | GPIO_Pin_2  | 
                                GPIO_Pin_4 | GPIO_Pin_5  | GPIO_Pin_6  | 
                                GPIO_Pin_7 | GPIO_Pin_12 | GPIO_Pin_13 | 
                                GPIO_Pin_15;      

  GPIO_Init(GPIOI, &GPIO_InitStructure);
  
  /* GPIOI configuration */
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOJ, GPIO_PinSource15 , GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_2  | GPIO_Pin_3  | 
                                GPIO_Pin_4  | GPIO_Pin_5  | GPIO_Pin_6  | GPIO_Pin_7  |
                                GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_10 | GPIO_Pin_11 |
                                GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;      

  GPIO_Init(GPIOJ, &GPIO_InitStructure);    
  
}

/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void LCD_Init(void)
{ 
  
  LTDC_InitTypeDef       LTDC_InitStruct;
  LTDC_Layer_InitTypeDef LTDC_Layer_InitStruct;
  LTDC_Layer_TypeDef     LTDC_Layerx;
	uint32_t i;

  /* Enable the LTDC Clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_LTDC, ENABLE);
  
  /* Enable the DMA2D Clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2D, ENABLE); 
  
  /* Configure the LCD Control pins */
  LCD_AF_GPIOConfig();  

  

  /* Polarity configuration */
  /* Initialize the horizontal synchronization polarity as active low */
  LTDC_InitStruct.LTDC_HSPolarity = LTDC_HSPolarity_AL;     
  /* Initialize the vertical synchronization polarity as active low */  
  LTDC_InitStruct.LTDC_VSPolarity = LTDC_VSPolarity_AL;     
  /* Initialize the data enable polarity as active low */
  LTDC_InitStruct.LTDC_DEPolarity = LTDC_DEPolarity_AL;     
  /* Initialize the pixel clock polarity as input pixel clock */ 
  LTDC_InitStruct.LTDC_PCPolarity = LTDC_PCPolarity_IPC;
  
  /* Configure R,G,B component values for LCD background color */                   
  LTDC_InitStruct.LTDC_BackgroundRedValue = 0;            
  LTDC_InitStruct.LTDC_BackgroundGreenValue = 0;          
  LTDC_InitStruct.LTDC_BackgroundBlueValue = 0;  
	
  /*phv */
	//GPIO_SetBits(GPIOA, GPIO_Pin_8);
  //GPIO_SetBits(GPIOC, GPIO_Pin_6);
	
	
#ifdef USE_LCD_AM640480
  /* Configure PLLSAI prescalers for LCD */
  /* Enable Pixel Clock */
  /* PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz */
  /* PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAI_N = 192 Mhz */
  /* PLLLCDCLK = PLLSAI_VCO Output/PLLSAI_R = 192/2 = 96 Mhz */
  /* LTDC clock frequency = PLLLCDCLK / RCC_PLLSAIDivR = 96/4 = 24 Mhz */
  RCC_PLLSAIConfig(192, 7, 2);
  RCC_LTDCCLKDivConfig(RCC_PLLSAIDivR_Div4);
  
  /* Enable PLLSAI Clock */
  RCC_PLLSAICmd(ENABLE);
  /* Wait for PLLSAI activation */
  while(RCC_GetFlagStatus(RCC_FLAG_PLLSAIRDY) == RESET)
  {
  }
  
  /* Timing configuration */  
  /* Configure horizontal synchronization width */     
  LTDC_InitStruct.LTDC_HorizontalSync = 29;
  /* Configure vertical synchronization height */
  LTDC_InitStruct.LTDC_VerticalSync = 2;
  /* Configure accumulated horizontal back porch */
  LTDC_InitStruct.LTDC_AccumulatedHBP = 143; 
  /* Configure accumulated vertical back porch */
  LTDC_InitStruct.LTDC_AccumulatedVBP = 34;  
  /* Configure accumulated active width */  
  LTDC_InitStruct.LTDC_AccumulatedActiveW = 783;
  /* Configure accumulated active height */
  LTDC_InitStruct.LTDC_AccumulatedActiveH = 514;
  /* Configure total width */
  LTDC_InitStruct.LTDC_TotalWidth = 799; 
  /* Configure total height */
  LTDC_InitStruct.LTDC_TotalHeigh = 524;
            
  LTDC_Init(&LTDC_InitStruct);
  /* Windowing configuration */
  /* Horizontal start = horizontal synchronization + Horizontal back porch = 43 
     Vertical start   = vertical synchronization + vertical back porch     = 12
     Horizontal stop = Horizontal start + LCD_PIXEL_WIDTH -1 
     Vertical stop   = Vertical start + LCD_PIXEL_HEIGHT -1        
  */      
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = 144;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (LCD_PIXEL_WIDTH + 144 - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = 35;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (LCD_PIXEL_HEIGHT + 35 - 1);
  
  /* Pixel Format configuration*/
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  /* Alpha constant (255 totally opaque) */
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 255; 
  /* Default Color configuration (configure A,R,G,B component values) */          
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0;
  /* Configure blending factors */       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;

  /* the length of one line of pixels in bytes + 3 then :
     Line Lenth = Active high width x number of bytes per pixel + 3 
     Active high width         = LCD_PIXEL_WIDTH 
     number of bytes per pixel = 2    (pixel_format : RGB565) 
  */
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((LCD_PIXEL_WIDTH * 2) + 3);
  /* the pitch is the increment from the start of one line of pixels to the 
     start of the next line in bytes, then :
     Pitch = Active high width x number of bytes per pixel     
  */ 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (LCD_PIXEL_WIDTH * 2);

